phone_book = {
    'Белозеров': ['+7 120 959 45 19'],
    'Владимиров': ['+7 (342) 787-1717'], 
    'Симонов': ['+7 550 642 49 52'], 
    'Герасимова': ['+7 056 273 2478']
}

# Добавляем новый номер для 
phone_book["Владимиров"].append('+79175694884')
phone_book["Белозеров"].append('+79175694884')
phone_book["Симонов"].append('+79175694884')
phone_book["Герасимова"].append('+79175694884')

last_name = input("Введите фамилию -> ") 

# Удаляем 'Герасимова'
phone_book.pop("Герасимова", None)

# Выводим все номера для фамилии
if last_name in phone_book:
    print(f"Номера для {last_name}: {phone_book[last_name]}")
else:
    print("Фамилия не найдена.")